lecture02/simulations/01TJunctionGasWithBaffleWall/0/p.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1.01e5;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    
    outlet1
    {
        type            fixedValue;
        value           uniform 1.01e5;
    }
    
    outlet2
    {
        type            fixedValue;
        value           uniform 1.01e5;
    }         

    walls
    {
        type            zeroGradient;
    }

    membrane
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
